import java.util.Scanner;
import java.util.Random;
import java.util.ArrayList;
import java.util.List;
import java.util.Arrays;
import java.util.LinkedList;

public class Ran
{
    public static void main(String[] args)
    {
        Random rand = new Random();
        String[] Hint = new String[76];
        String[] name = new String[76];
        Scanner in = new Scanner(System.in);
        Hint[0] = "นายปกรณ์ ชนะพิม";
        Hint[1] = "นายวัชรพล บุญจันทร์";
        Hint[2] = "นางสาวริว ตุ้มเทียน";
        Hint[3] = "นายอรรถพร หงษ์ทอง";
        Hint[4] = "นางสาวอภิญญา ศรีเจริญรุ่งเรือง";
        Hint[5] = "นางสาวธนัชญา อินผึ้ง";
        Hint[6] = "นายอนันชัย เตชะเลิศพนา";
        Hint[7] = "นางสาวสุภิชย์ญา คำอำพร";
        Hint[8] = "นางสาวสุพิชญา เพชรรัตน์";
        Hint[9] = "นางสาวสุนิษา ไกรเพชร";
        Hint[10] = "นางสาวสิริรักษ์ เพชรนิตย์";
        Hint[11] = "นายสิทธินันท์ ชูแก้ว";
        Hint[12] = "นายสิทธิโชค ทองทับ";
        Hint[13] = "นางสาวสิครินธรณ์ นิลบรรหาร";
        Hint[14] = "นางสาวสาลินี แก้วสะแสน";
        Hint[15] = "นางสาวสติพร พราหมณี";
        Hint[16] = "นายสราวุฒิ มั่นอ่วม";
        Hint[17] = "นายศุภกฤต แก่นนาค";
        Hint[18] = "นายศุภกร จีวัฒนา";
        Hint[19] = "นาย กันณพงศ์ เอี่ยมทิพย์";//
        Hint[20] = "นางสาวศีตลา แสงทับทิม";
        Hint[21] = "นางสาวศิริพร ธนะสินธุ์";
        Hint[22] = "นายศิวกร พุ่มพวง";
        Hint[23] = "นายศิรนพ อยู่อ่ำ";
        Hint[24] = "นายศัภยา พนาลัย";
        Hint[25] = "นางสาวศศินันท์ บุญมา";
        Hint[26] = "นายศราวุฒิ เศรษฐี";
        Hint[27] = "นางสาววาสนา เกตุชาวนา";
        Hint[28] = "นายวรชนก ซิมงาม";
        Hint[29] = "นายเมธาวี ปันนา";
        Hint[30] = "นางสาวมินธิรา มีเชื้อ";
        Hint[31] = "นางสาวมาริษา สิงห์โตเกษม";
        Hint[32] = "นายภาณุพงษ์ เย็นคำ";
        Hint[33] = "นายภัทรดนัย ชาบาง";
        Hint[34] = "นางสาวภัคมน จำปาแดง";
        Hint[35] = "นางสาวพีรยา ใจเย็น";
        Hint[36] = "นางสาวพัชณี เกตสำเภา";
        Hint[37] = "นายพชรพล กักขุนทศ";
        Hint[38] = "นายพชรดนัย แสงศรี";
        Hint[39] = "นายปุณณมา ขันศีลา";
        Hint[40] = "นายปัณณวัฒน์ ฟุกฟัก";
        Hint[41] = "นายประนิวัฒน์ แก้วเสมอ";
        Hint[42] = "นายปณิธิ ยอดนิล";
        Hint[43] = "นายปฐมรัฐ ภู่ประดิษฐ์";
        Hint[44] = "นายปกรณ์วิชญ์ จันทร์อินทร์";
        Hint[45] = "นายบัญญพนต์ แสงนาค";
        Hint[46] = "นายนวบดินทร์ สัณหวัณภัคดี";
        Hint[47] = "นางสาวนภัสสร วันดี";
        Hint[48] = "นายนนทิพัฒน์ พิบูลย์มณี";
        Hint[49] = "นางสาวมลธิชา จินวรรณวงศ์";
        Hint[50] = "นายธรณ์เทพ หอมจันทร์";
        Hint[51] = "นายธนภัทร มณีรอด";
        Hint[52] = "นายธนดล สุวรรณ";
        Hint[53] = "นายณัฐวุฒิ ใจปันทา";
        Hint[54] = "นายณัฐดนัย เอี่ยมกาย";
        Hint[55] = "นายณัฐชนน พลเยี่ยม";
        Hint[56] = "นายณัฐกิตติ์ จิตนาธรรม";
        Hint[57] = "นางสาวณัชชา อะวะศรี";
        Hint[58] = "นางสาวฐาปนัตตา ม่วงคำ";
        Hint[59] = "นางสาวญาสุมินทร์ สุภาการณ์";
        Hint[60] = "นายชินกฤต แถมพยัคฆ์";
        Hint[61] = "นางสาวชัญญานุช อุดธา";
        Hint[62] = "นายชยานันต์ สอนชัย";
        Hint[63] = "นายชยางกูร บัวชื่น";
        Hint[64] = "นางสาวชนิตสิรี ทวีกุล";
        Hint[65] = "นางสาวกุลจิรา ไชยสัจ";
        Hint[66] = "นายกีรฎิกรณ์ ยมหาด";
        Hint[67] = "นายกิตติพศ ศรีนาคล้วน";
        Hint[68] = "นางสาวกิตติญานี ภิระคำ";
        Hint[69] = "นางสาวกัญญาพัชร ชุ่มเย็น";
        Hint[70] = "นายกฤษกร ทิพย์ลุ้ย";
        Hint[71] = "นายศุภนิมิต สอนจันทร์";
        Hint[72] = "นายเสกสรรค์ ปฏิสนธิ";
        Hint[73] = "นายศักดากร กวยวงศา";
        Hint[74] = "นายดนัย ภิญโญศรี";
        Hint[75] = "นางสาวกนกวรรณ สดงาม";

        name[0] = "กฤษกร เล้าสมบูรณ์";
        name[1] = "ศักดิ์ดา กลิ่นบุญ";
        name[2] = "ณัฐวัตร เทศสกุล";
        name[3] = "กฤษฎา สืบสิงห์";
        name[4] = "กฤษฎาพงษ์ คำนันท์";
        name[5] = "กษมา พิเลิศ";
        name[6] = "กัญญารัตน์ นาคสนธิ์";
        name[7] = "กิตติศักดิ์ ขุนทอง";
        name[8] = "ขณิชา พจนพิมล";
        name[9] = "คมสัน ช่ออ่อน";
        name[10] = "จอมทรัพย์ โรจน์พวง";
        name[11] = "เจตนิพิฐ อินกันยา";
        name[12] = "ชนสิษฎ์ อำภวัน";
        name[13] = "ชนาภัทร เพชรมา";
        name[14] = "ฐณวัฒน์ ชัยกิตติสมบูรณ์";
        name[15] = "ฐณะวัฒน์ สุขประเสริฐ";
        name[16] = "ฐานิสสะรา พูนบุญญากร";
        name[17] = "ฐิติพร มุ้ยแก้ว";
        name[18] = "ณัฎฐนิชา สินดี";
        name[19] = "ณัฐกมล อินทูล";
    
        name[20] = "ณัฐชนน พงษ์รัตนานุกุล";
        name[21] = "ณัฐพร ยอยยิ้ม";
        name[22] = "ธนวัฒน์ อินทรสำราญ";
        name[23] = "ธนาธิป คำปินตา";
        name[24] = "ธนิดา คงวังทอง";
        name[25] = "ธาดาพงศ์ เกษรพรม";
        name[26] = "ธีรภัทร คล้ายเรียน";
        name[27] = "ธีรภัทร นรากรณ์";
        name[28] = "นพิดา มีทอง";
        name[29] = "นันทพงศ์ คงยุทธ์";
        name[30] = "บวรนันท์ ม้วนเพ็ง";
        name[31] = "บุรพล แสนธิ";
        name[32] = "ปณิดา คันภิรมย์";
        name[33] = "ปรมินทร์ สุนันท์";
        name[34] = "ปัญญดา พันผง";
        name[35] = "ปิยะโชค แสงบุดดี";
        name[36] = "พรรณวดี แก้วผัด";
        name[37] = "พันดาว แข็งขัน";
        name[38] = "พันธ์ฤทธิ์ นวลหิงษ์";
        name[39] = "พีระ บุญวราเดชา";
        name[40] = "ภัทรกรัณย์ จิตอารีย์รัตน์";
        name[41] = "ภาณุพันธ์ อินจันทร์";
        name[42] = "ยศพร โกษาวัฒนกุล";
        name[43] = "วชิรพล โตสวัสดิ์";
        name[44] = "วาริษ วงศ์อิสลาม";
        name[45] = "ศิริรัตน์ เสมงคล";
        name[46] = "เศรษฐพงศ์ เลิศฤทธิ์รุ่งโรจน์";
        name[47] = "สโรชา ศรีพยัคฆ์";
        name[48] = "สิรินทรา ช่อชั้น";
        name[49] = "สุภาพร ประพัตน์";
        name[50] = "สุรสิทธิ์ ค้อมทอง";
        name[51] = "อภิชาติ ศรีกุดเลาะ";
        name[52] = "อดิศร มองทรัพย์";
        name[53] = "อภิญญา เหลื่อมเพชร";
        name[54] = "อภิญญา นาคมณี";
        name[55] = "จิตรการ กองดิน";
        name[56] = "ก้องกิดากรณ์ จันทร์ศร";
        name[57] = "กัญญารัตน์ ศรีสุวรรณ์";
        name[58] = "กัลยรัตน์ แสงประสาน";
        name[59] = "ญาณิศา ดอกไม้เทศ";
        name[60] = "ณัฐณิชา ทองเทศ";
        name[61] = "ณัฐริกา เจริญนาน";
        name[62] = "ไตรรัตน์ โพธิ์แส";
        name[63] = "ธนบดี เตมีสุภาพ";
        name[64] = "ธนรัตน์ ทองชาวนา";
        name[65] = "ธารารัตน์ โพธิ์หอม";
        name[66] = "พีระพัฒน์ งามสม";
        name[67] = "ภูวเนศวร์ กลั่นหุ่น";
        name[68] = "ลัคนา ธรรมถาวร";
        name[69] = "วัทธิกร จงพานิช";
        name[70] = "สุดารัตน์ สิทธิ์สงคราม";
        name[71] = "สุดารัตน์ ทองมีมาก";
        name[72] = "สุรเชษฐ์ กลั่นหุ่น";
        name[73] = "อรุโนทัย ข้าวสามรวง";
        name[74] = "";
        name[75] = "";


        List<String> hintsConverted = new LinkedList<String>(Arrays.asList(Hint));
        List<String> nameConvereted = new LinkedList<String> (Arrays.asList(name));
        int times = Hint.length;
        while(times > -1)
        {
            if (hintsConverted.size() == 0)
            {
              break;
            }
            System.out.println("press p to show the  name !");
            String input = in.nextLine();
          
            if (input.equalsIgnoreCase("p"))
            {
              int oneNum = rand.nextInt(times);
              int checkname = rand.nextInt(times);
              /*if()
              {
                hintsConverted.remove(oneNum);
                System.out.println("พี่ชื่อ กันณพงศ์ เอี่ยมทิพย์");
                System.out.println("น้องชื่อ ณัฐชนน พงษ์รัตนานุกุล");
                nameConver.remove(checkname);
                times--;
              }*/
                
            //  @Scheduled(fixedRate = 5000)
              System.out.println("พี่ชื่อ "+(hintsConverted.get(oneNum)));
              hintsConverted.remove(oneNum);
              //zone dek63
              System.out.println("น้องชื่อ "+(nameConvereted.get(checkname)));
              nameConvereted.remove(checkname);
              times--;
             
           }
      
        }
        System.out.println("Done!");
        System.out.println("Random program created by P Soda ");
       in.close();
    }
}